zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32f460_adtim.h
//    p_hw_adtim->hstpr = 0;

    return AM_TRUE;
}

/**
 * \brief 使能硬件停止事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_enablehwstop(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->hstpr |= (1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 禁止硬件停止事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_disablehwstop(amhw_hc32f460_adtim_t *p_hw_adtim){

//    p_hw_adtim->hstpr &= ~(1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 配置硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32f460_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_cfghwclear(amhw_hc32f460_adtim_t        *p_hw_adtim,
                                       amhw_hc32f460_adtim_hw_trig_t choice) {

//    if(choice > AMHW_HC32F460_ADTIM_HwTrigTimTriDFall) {
//        return AM_FALSE;
//    }

//    p_hw_adtim->hcelr |= (1ul << choice);

    return AM_TRUE;
}

/**
 * \brief 清除硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearhwclear(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->hcelr = 0;

    return AM_TRUE;
}

/**
 * \brief 使能硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_enablehwclear(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->hcelr |= (1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 禁止硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_disablehwclear(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->hcelr &= ~(1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 配置A通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32f460_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_cfghwcaptureA(amhw_hc32f460_adtim_t        *p_hw_adtim,
                                          amhw_hc32f460_adtim_hw_trig_t choice) {

    if(choice > AMHW_HC32F460_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->HCPAR |= (1ul << choice);
    p_hw_adtim->PCONR |= (1ul << 0 );

    return AM_TRUE;
}

/**
 * \brief 清除A通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearhwcaptureA(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->hcpar = 0;

    return AM_TRUE;
}

/**
 * \brief 配置B通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32f460_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_cfghwcaptureB(amhw_hc32f460_adtim_t        *p_hw_adtim,
                                          amhw_hc32f460_adtim_hw_trig_t choice) {

    if(choice > AMHW_HC32F460_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->HCPBR |= (1ul << choice);
    p_hw_adtim->PCONR |= (1ul << 16 );

    return AM_TRUE;
}

/**
 * \brief 清除B通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearhwcaptureB(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->hcpbr = 0;

    return AM_TRUE;
}

/**
 * \brief 软件同步启动
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_swsyncstart(amhw_hc32f460_adtim_sw_sync_t *p_cfg) {

//    if(p_cfg->adtim4) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sstar = (1ul << 0);
//    }

//    if(p_cfg->adtim5) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sstar = (1ul << 1);
//    }

//    if(p_cfg->adtim6) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sstar = (1ul << 2);
//    }

    return AM_TRUE;
}

/**
 * \brief 软件同步停止
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_swsyncstop(amhw_hc32f460_adtim_sw_sync_t *p_cfg) {

//    if(p_cfg->adtim4) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sstpr = (1ul << 0);
//    }
//    if(p_cfg->adtim5) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sstpr = (1ul << 1);
//    }
//    if(p_cfg->adtim6) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sstpr = (1ul << 2);
//    }

    return AM_TRUE;
}

/**
 * \brief 软件同步清零
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_swsyncclear(amhw_hc32f460_adtim_sw_sync_t *p_cfg) {

//    if(p_cfg->adtim4) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sclrr = (1ul << 0);
//    }
//    if(p_cfg->adtim5) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sclrr = (1ul << 1);
//    }
//    if(p_cfg->adtim6) {
//        ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->sclrr = (1ul << 2);
//    }

    return AM_TRUE;
}

/**
 * \brief 获取软件同步状态
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：获取失败
 *         AM_TRUE  ：获取成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setswsyncstate(amhw_hc32f460_adtim_sw_sync_t *p_cfg) {

//    amhw_hc32f460_adtim_t *p_hw_adtim4 = (amhw_hc32f460_adtim_t *)HC32_TIM4_BASE;

//    p_cfg->adtim4 = (p_hw_adtim4->sstar >> 0) & 1ul ? AM_TRUE : AM_FALSE;
//    p_cfg->adtim5 = (p_hw_adtim4->sstar >> 1) & 1ul ? AM_TRUE : AM_FALSE;
//    p_cfg->adtim6 = (p_hw_adtim4->sstar >> 2) & 1ul ? AM_TRUE : AM_FALSE;

    return AM_TRUE;
}

/**
 * \brief AOS触发配置
 *
 * \param[in] p_cfg : 指向AOS触发配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_aostrigcfg(amhw_hc32f460_adtim_aos_trig_cfg_t *p_cfg){

//    amhw_hc32f460_adtim_t *p_hw_adtim4 = (amhw_hc32f460_adtim_t *)HC32_TIM4_BASE;

//    if(p_cfg == NULL) {
//        return AM_FALSE;
//    }

//    p_hw_adtim4->itrig  = 0;
//    p_hw_adtim4->itrig |= (p_cfg->aos0trig_src << 0);
//    p_hw_adtim4->itrig |= (p_cfg->aos1trig_src << 4);
//    p_hw_adtim4->itrig |= (p_cfg->aos2trig_src << 8);
//    p_hw_adtim4->itrig |= (p_cfg->aos3trig_src << 12);

    return AM_TRUE;
}

/**
 * \brief 中断触发使能配置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向中断使能配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32f460_adtim_irqtrigcfg(
              amhw_hc32f460_adtim_t              *p_hw_adtim,
              amhw_hc32f460_adtim_irq_trig_cfg_t *p_cfg);

/**
 * \brief 端口触发配置
 *
 * \param[in] trigport : amhw_hc32f460_adtim_trig_port_t端口枚举量
 * \param[in] p_cfg    : 指向端口配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32f460_adtim_porttrigcfg(
              amhw_hc32f460_adtim_trig_port_t      trigport,
              amhw_hc32f460_adtim_port_trig_cfg_t *p_cfg);

/**
 * \brief CHxX端口配置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32f460_adtim_chx_t通道枚举量
 * \param[in] p_cfg      : 指向TIMxX端口配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32f460_adtim_timxchxportcfg(
              amhw_hc32f460_adtim_t                   *p_hw_adtim,
              amhw_hc32f460_adtim_chx_t                port,
              amhw_hc32f460_adtim_timx_chx_port_cfg_t *p_cfg);

/**
 * \brief 使能端口刹车
 *
 * \param[in] port       : 端口编号（0~15）
 * \param[in] p_cfg      : 指向TADT刹车端口配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_enablebrakeport(
              uint8_t                             port,
              amhw_hc32f460_adtim_break_port_cfg_t *p_cfg) {

//    amhw_hc32f460_adtim_t *p_hw_adtim4 = (amhw_hc32f460_adtim_t *)HC32_TIM4_BASE;

//    if(p_cfg == NULL) {
//        return AM_FALSE;
//    }

//    p_hw_adtim4->ptbkp &= ~(1ul << port);
//    p_hw_adtim4->ptbkp |= (p_cfg->polaritysel << port);
//    p_hw_adtim4->ptbks |= (1ul << port);

    return AM_TRUE;
}

/**
 * \brief 清除端口刹车
 */
am_static_inline
void amhw_hc32f460_adtim_clearbrakeport(void) {

//    ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->ptbks = 0;
}

/**
 * \brief 无效条件3配置(端口刹车)
 *
 * \param[in] p_cfg      : 指向TADT无效条件3配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32f460_adtim_disable3cfg(
              amhw_hc32f460_adtim_disable_3_cfg_t *p_cfg);

/**
 * \brief 软件刹车 Enable/Disable(仅适用于无效条件3使能的情况下)
 *
 * \param[in] flag      : AM_FALSE(禁能) 或       AM_TRUE(使能)
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_swbrake(am_bool_t flag) {

//    amhw_hc32f460_adtim_t *p_hw_adtim4 = (amhw_hc32f460_adtim_t *)HC32_TIM4_BASE;

