zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32f460_adtim.h
//    p_hw_adtim4->aossr &= ~(1ul << 7);
//    p_hw_adtim4->aossr |= (flag << 7);

    return AM_TRUE;
}

/**
 * \brief 获取端口刹车标志
 *
 * \return AM_FALSE ：禁能状态
 *         AM_TRUE  ：使能状态
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_getportbrakeflag(void) {
//    return ((((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->aossr >> 0) & 1ul) ?
//           AM_TRUE :
//           AM_FALSE;
    return AM_TRUE;
}

/**
 * \brief 清除端口刹车标志
 *
 */
am_static_inline
void amhw_hc32f460_adtim_clearportbrakeflag(void) {

//    ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->aoscl &= ~(1ul << 0);
}

/**
 * \brief 无效条件1配置(同高同低刹车)
 *
 * \param[in] p_cfg : 指向TADT无效条件1配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_disable1Cfg(
              amhw_hc32f460_adtim_disable_1_cfg_t *p_cfg) {

//    amhw_hc32f460_adtim_t *p_hw_adtim4 = (amhw_hc32f460_adtim_t *)HC32_TIM4_BASE;

//    if(p_cfg == NULL) {
//        return AM_FALSE;
//    }

//    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 13))) |
//                         (p_cfg->tim6_outsh << 13);
//    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 12))) |
//                         (p_cfg->tim5_outsh << 12);
//    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 11))) |
//                         (p_cfg->tim4_outsh << 11);
//    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 10))) |
//                         (p_cfg->tim6_outsl << 10);
//    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 9))) |
//                         (p_cfg->tim5_outsl << 9);
//    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 8))) |
//                         (p_cfg->tim4_outsl << 8);

    return AM_TRUE;
}

/**
 * \brief 获取同高同低刹车标志
 *
 * \return AM_FALSE ：0
 *         AM_TRUE  ：1
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_getsamebrakeflag(void) {
//    return ((((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->aossr >> 1) & 1ul) ?
//           AM_TRUE :
//           AM_FALSE;
    return AM_TRUE;
}

/**
 * \brief 清除同高同低刹车标志
 *
 */
am_static_inline
void amhw_hc32f460_adtim_clearsamebrakeflag(void) {
//    ((amhw_hc32f460_adtim_t *)HC32_TIM4_BASE)->aoscl &= ~(1ul << 1);
}

/**
 * \brief PWM展频配置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向PWM展频计数配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_pwmdithercfg(
              amhw_hc32f460_adtim_t                *p_hw_adtim,
              amhw_hc32f460_adtim_pwm_dither_cfg_t *p_cfg) {
//    if(p_cfg == NULL) {
//        return AM_FALSE;
//    }

//    p_hw_adtim->cr = (p_hw_adtim->cr & (~(1ul << 10))) |
//                     (p_cfg->enAMHW_HC32F460_ADTIM_PDType << 10);
//    p_hw_adtim->cr = (p_hw_adtim->cr & (~(1ul << 9))) |
//                     (p_cfg->bTimxBPDEn << 9);
//    p_hw_adtim->cr = (p_hw_adtim->cr & (~(1ul << 8))) |
//                     (p_cfg->bTimxAPDEn << 8);

    return AM_TRUE;
}

/**
 * \brief ADTIM初始化
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向ADT基本计数配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_init(amhw_hc32f460_adtim_t             *p_hw_adtim,
                                 amhw_hc32f460_adtim_basecnt_cfg_t *p_cfg) {
    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    if((p_cfg->cntmode) > AMHW_HC32F460_ADTIM_CNT_MODE_TRIANGLE_B) {
        return AM_FALSE;
    }

    p_hw_adtim->GCONR &= ~(7ul << 1);
    p_hw_adtim->GCONR &= ~(7ul << 4);
    p_hw_adtim->GCONR &= ~(1ul << 8);

    p_hw_adtim->GCONR |= (p_cfg->cntmode << 1);
    p_hw_adtim->GCONR |= (p_cfg->cntclkdiv << 4);
    p_hw_adtim->GCONR |= (p_cfg->cntdir << 8);

    return AM_TRUE;
}

am_static_inline
amhw_hc32f460_adtim_pclk_div_t
amhw_hc32f460_adtim_clkdiv_get(amhw_hc32f460_adtim_t *p_hw_adtim) {

    return (amhw_hc32f460_adtim_pclk_div_t)((p_hw_adtim->GCONR >> 4) & 7ul);
}


/**
 * \brief ADTIM去初始化
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32f460_adtim_deinit(amhw_hc32f460_adtim_t *p_hw_adtim);

/**
 * \brief ADTIM启动
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_startcount(amhw_hc32f460_adtim_t *p_hw_adtim) {

    p_hw_adtim->GCONR |= (1ul << 0);

    return AM_TRUE;
}

/**
 * \brief ADTIM停止
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_stopcount(amhw_hc32f460_adtim_t *p_hw_adtim) {

    p_hw_adtim->GCONR &= ~(1ul << 0);

    return AM_TRUE;
}

/**
 * \brief 设置计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] cnt        ： 计数值设定
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setcount(amhw_hc32f460_adtim_t *p_hw_adtim,
                                     uint16_t             cnt) {

    p_hw_adtim->CNTER= cnt;

    return AM_TRUE;
}

/**
 * \brief 获取计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return 计数值
 */
am_static_inline
uint16_t amhw_hc32f460_adtim_getcount(amhw_hc32f460_adtim_t *p_hw_adtim) {
    return p_hw_adtim->CNTER;
}

/**
 * \brief 清除计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearcount(amhw_hc32f460_adtim_t *p_hw_adtim) {

    p_hw_adtim->CNTER = 0;

    return AM_TRUE;
}

/**
 * \brief 获取有效周期计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return 有效周期计数值
 */
am_static_inline
uint8_t amhw_hc32f460_adtim_getvpernum(amhw_hc32f460_adtim_t *p_hw_adtim) {
//    return ((p_hw_adtim->stflr >> 21) & 0x7ul);
    return AM_TRUE;
}

/**
 * \brief 获取状态标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32f460_adtim_state_type_t状态标志枚举量
 *
 * \return AM_FALSE ：标志无效
 *         AM_TRUE  ：标志有效
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_getstate(amhw_hc32f460_adtim_t           *p_hw_adtim,
                                     amhw_hc32f460_adtim_state_type_t type) {
//    return ((p_hw_adtim->stflr >> type) & 1ul) ? AM_TRUE : AM_FALSE;
    return AM_TRUE;
}

