zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32f460_adtim.h
typedef enum adtim_period_x
{
    ADTIM_PERIODA = 0u,         
    ADTIM_PERIODB = 1u,         
    ADTIM_PERIODC = 2u,         
}adtim_period_x_t;

/**
 * \brief 配置计数周期
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 计数周期设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setperiod(amhw_hc32f460_adtim_t *p_hw_adtim,
                                      adtim_period_x_t     pri,
                                      uint16_t             data) {
    switch (pri)
    {
        case ADTIM_PERIODA:
            p_hw_adtim->PERAR = data;
            break;
        case ADTIM_PERIODB:
            p_hw_adtim->PERBR = data;
            break;
        case ADTIM_PERIODC:
            p_hw_adtim->PERCR = data;
            break;
        default:
            break;
    }
    return AM_TRUE;
}

/**
 * \brief 获取计数周期
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return 计数周期
 */
am_static_inline
uint16_t amhw_hc32f460_adtim_getperiod(amhw_hc32f460_adtim_t *p_hw_adtim, adtim_period_x_t pri) {
    uint16_t value = 0;
    switch (pri)
    {
        case ADTIM_PERIODA:
            value = p_hw_adtim->PERAR;
            break;
        case ADTIM_PERIODB:
            value = p_hw_adtim->PERBR;
            break;
        case ADTIM_PERIODC:
            value = p_hw_adtim->PERCR;
            break;
        default:
            break;
    }

    return value;
}

/**
 * \brief 配置计数周期缓冲
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 周期缓冲设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setperiodbuf(amhw_hc32f460_adtim_t *p_hw_adtim,
                                         uint16_t             data) {
//    p_hw_adtim->perbr  = data;
//    p_hw_adtim->bconr |= (1ul << 8);

    return AM_TRUE;
}

/**
 * \brief 清除计数周期缓冲
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearperiodbuf(amhw_hc32f460_adtim_t *p_hw_adtim) {

//    p_hw_adtim->bconr &= ~(1ul << 8);
//    p_hw_adtim->perbr  = 0;

    return AM_TRUE;
}

/**
 * \brief 配置有效计数周期
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向ADT有效计数周期配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setvalidperiod(
              amhw_hc32f460_adtim_t              *p_hw_adtim,
              amhw_hc32f460_adtim_validper_cfg_t *p_cfg) {
//    if(p_cfg == NULL) {
//        return AM_FALSE;
//    }

//    p_hw_adtim->vperr  = 0;
//    p_hw_adtim->vperr |= (p_cfg->validcnt << 18);
//    p_hw_adtim->vperr |= (p_cfg->validcdt << 16);
//    p_hw_adtim->vperr |= (p_cfg->period_D << 3);
//    p_hw_adtim->vperr |= (p_cfg->period_C << 2);
//    p_hw_adtim->vperr |= (p_cfg->period_B << 1);
//    p_hw_adtim->vperr |= (p_cfg->period_A << 0);

    return AM_TRUE;
}

/**
 * \brief 配置比较输出计数基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] compare    : amhw_hc32f460_adtim_compare_x_t枚举量
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setcomparevalue(
              amhw_hc32f460_adtim_t          *p_hw_adtim,
              amhw_hc32f460_adtim_compare_x_t compare,
              uint16_t                      data) {

    switch(compare) {
    case AMHW_HC32F460_ADTIM_COMPARE_A:
        p_hw_adtim->GCMAR = data;
        break;
    case AMHW_HC32F460_ADTIM_COMPARE_B:
        p_hw_adtim->GCMBR = data;
        break;
    case AMHW_HC32F460_ADTIM_COMPARE_C:
        p_hw_adtim->GCMCR = data;
        break;
    case AMHW_HC32F460_ADTIM_COMPARE_D:
        p_hw_adtim->GCMDR = data;
        break;
    case AMHW_HC32F460_ADTIM_COMPARE_E:
        p_hw_adtim->GCMER = data;
        break;
    case AMHW_HC32F460_ADTIM_COMPARE_F:
        p_hw_adtim->GCMFR = data;
        break;        
    default:
        return AM_FALSE;
    }

    return AM_TRUE;
}

/**
 * \brief 配置专用比较计数基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] compare    : amhw_hc32f460_adtim_special_compare_x_t枚举量
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setspecilcomparevalue(
              amhw_hc32f460_adtim_t                  *p_hw_adtim,
              amhw_hc32f460_adtim_special_compare_x_t compare,
              uint16_t                              data) {
//    switch(compare) {
//    case AMHW_HC32F460_ADTIM_SPCL_COMP_A:
//        p_hw_adtim->scmxr[0] = data;
//        break;
//    case AMHW_HC32F460_ADTIM_SPCL_COMP_B:
//        p_hw_adtim->scmxr[1] = data;
//        break;
//    default:
//        return AM_FALSE;
//    }

    return AM_TRUE;
}

/**
 * \brief 配置通用比较值/捕获值的缓存传送
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] compare    : amhw_hc32f460_adtim_chx_t枚举量
 * \param[in] enable     : 使能状态（AM_FALSE或AM_TRUE）
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_enablevaluebuf(amhw_hc32f460_adtim_t    *p_hw_adtim,
                                           amhw_hc32f460_adtim_chx_t port,
                                           am_bool_t               enable) {
//    switch(port) {
//    case AMHW_HC32F460_ADTIM_CHX_A:
//        p_hw_adtim->bconr = (p_hw_adtim->bconr & (~(1ul << 0))) |
//                            (enable << 0);
//        break;
//    case AMHW_HC32F460_ADTIM_CHX_B:
//        p_hw_adtim->bconr = (p_hw_adtim->bconr & (~(1ul << 2))) |
//                            (enable << 2);
//        break;
//    default:
//        return AM_FALSE;
//    }

    return AM_TRUE;
}

/**
 * \brief 清除比较输出计数值/捕获值缓存
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32f460_adtim_chx_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearvaluebuf(amhw_hc32f460_adtim_t    *p_hw_adtim,
                                          amhw_hc32f460_adtim_chx_t port) {
//    switch(port) {
//    case AMHW_HC32F460_ADTIM_CHX_A:
//        p_hw_adtim->gcmxr[2] = 0;
//        break;
//    case AMHW_HC32F460_ADTIM_CHX_B:
//        p_hw_adtim->gcmxr[3] = 0;
//        break;
//    default:
//        return AM_FALSE;
//    }

    return AM_TRUE;
}

/**
 * \brief 获取捕获值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32f460_adtim_chx_t枚举量
 *
 * \return 捕获值
 */
am_static_inline
uint16_t amhw_hc32f460_adtim_getcapturevalue(amhw_hc32f460_adtim_t    *p_hw_adtim,
                                           amhw_hc32f460_adtim_chx_t port) {
    switch(port) {
    case AMHW_HC32F460_ADTIM_CHX_A:
        return p_hw_adtim->GCMAR;
    case AMHW_HC32F460_ADTIM_CHX_B:
        return p_hw_adtim->GCMBR;
    default:
        return AM_FALSE;
    }
}

/**
 * \brief 获取捕获缓存值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32f460_adtim_chx_t枚举量
 *
 * \return 捕获缓存值
 */
am_static_inline
uint16_t amhw_hc32f460_adtim_getcapturebuf(amhw_hc32f460_adtim_t     *p_hw_adtim,
                                          amhw_hc32f460_adtim_chx_t port) {
//    switch(port) {
//    case AMHW_HC32F460_ADTIM_CHX_A:
//        return p_hw_adtim->gcmxr[2];
//    case AMHW_HC32F460_ADTIM_CHX_B:
//        return p_hw_adtim->gcmxr[3];
//    default:
//        return AM_FALSE;
//    }
    return AM_TRUE;
}

/**
 * \brief 设置死区时间上基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setdtua(amhw_hc32f460_adtim_t *p_hw_adtim,
                                    uint16_t             data) {
//    p_hw_adtim->dtuar = data;

    return AM_TRUE;
}

/**
 * \brief 设置死区时间下基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_setdtda(amhw_hc32f460_adtim_t *p_hw_adtim,
                                    uint16_t data) {
//    p_hw_adtim->dtdar = data;

    return AM_TRUE;
}

/**
 * \brief 配置死区时间功能
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] enable     : 死区功能使能（AM_FALSE或AM_TRUE）
 * \param[in] equal      : DTDAR的值和DTUAR的值自动相等使能（AM_FALSE或AM_TRUE）
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_cfgdt(amhw_hc32f460_adtim_t *p_hw_adtim,
                                  am_bool_t            enable,
                                  am_bool_t            equal) {

