zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32f460_adtim.h
//    p_hw_adtim->dconr = (p_hw_adtim->dconr &(~(1ul << 0))) |
//                        (enable << 0);

//    p_hw_adtim->dconr = (p_hw_adtim->dconr &(~(1ul << 8))) |
//                        (equal << 8);

    return AM_TRUE;
}

/**
 * \brief 配置中断
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32f460_adtim_irq_type_t中断类型枚举量
 * \param[in] equal      : 相应中断使能（AM_FALSE或AM_TRUE）
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_cfgirq(amhw_hc32f460_adtim_t         *p_hw_adtim,
                                   amhw_hc32f460_adtim_irq_type_t type,
                                   am_bool_t                    enable) {
    if(enable == AM_TRUE) {
        p_hw_adtim->ICONR |= (1ul << type);
    } else {
        p_hw_adtim->ICONR &= ~(1ul << type);
    }

    return AM_TRUE;
}

/**
 * \brief 获取中断标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32f460_adtim_irq_type_t中断类型枚举量
 *
 * \return AM_FALSE:标志无效
 *         AM_TRUE :标志有效
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_get_status_flag(amhw_hc32f460_adtim_t         *p_hw_adtim,
                                       amhw_hc32f460_adtim_state_type_t type) {
    return ((p_hw_adtim->STFLR >> type) & 1ul) ? AM_TRUE : AM_FALSE;
}

/**
 * \brief 清除中断标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32f460_adtim_irq_type_t中断类型枚举量
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clear_status_flag(amhw_hc32f460_adtim_t         *p_hw_adtim,
                                         amhw_hc32f460_adtim_state_type_t type) {
    p_hw_adtim->STFLR &= ~(1ul << type);

    return AM_TRUE;
}

/**
 * \brief 清除所有中断标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_clearallirqflag(amhw_hc32f460_adtim_t *p_hw_adtim) {

    p_hw_adtim->STFLR = 0;

    return AM_TRUE;
}

/**
 * \brief Z相输入屏蔽设置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向Z相输入屏蔽功能配置结构体的指针
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32f460_adtim_cfgzmask(amhw_hc32f460_adtim_t           *p_hw_adtim,
                                     amhw_hc32f460_adtim_zmask_cfg_t *p_cfg) {
//    if(p_cfg == NULL) {
//        return AM_FALSE;
//    }

//    p_hw_adtim->gconr = (p_hw_adtim->gconr & (~(3ul << 18))) |
//                        (p_cfg->zmask_cycle << 18);

//    p_hw_adtim->gconr = (p_hw_adtim->gconr & (~(1ul << 17))) |
//                        (p_cfg->fltposcntmask << 17);

//    p_hw_adtim->gconr = (p_hw_adtim->gconr & (~(1ul << 16))) |
//                        (p_cfg->fltrevcntmask << 16);

    return AM_TRUE;
}

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __AMHW_HC32F460_ADTIM_H */

/* end of file */
